---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalSurfaceCannotMove
source: html/36610d46-ed07-589f-8854-197f83874006.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalSurfaceCannotMove Property

Cannot move analytical surface.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalSurfaceCannotMove { get; }
```